#ให้ทำโปรเเกรมป้อนจำนวนเงิน เเละจำนวนคนทางเเป้นพิมพ์ เเละเเสดงผมออกมาว่า
#จำนวนเงิน ??? บาท จำนวนคน ??? ต้องหารกันคนละ ??? บาท
#ให้เเสดงผลโดยใช้ print ทั้ง 5 เเบบ
money = input('ใส่จำนวนเงิน : ')
person = input('ใส่จำนวนคน : ')
result = float(money) / int(person)

print('...............................')
print(f'จำนวนเงิน {float(money):,.2f} บาท จำนวนคน {person} ต้องหารคนละ {result:.2f} บาท')
print('จำนวนเงิน {:,.2f} บาท จำนวนคน {} ต้องหารคนละ {:,.2f} บาท'.format(float(money), person, result))
print('จำนวนเงิน '+ f'{float(money):,.2f}' + " บาท " + "จำนวนคน " + person + " ต้องหารคนละ " + f'{result:.2f}' + " บาท")
print('จำนวนเงิน', f'{float(money):,.2f}', 'บาท', "จำนวนคน", person, 'ต้องหารคนละ', f'{result:.2f}', "บาท")
print('จำนวนเงิน %s บาท จำนวนคน %s ต้องหารคนละ %.2f บาท' % (f'{float(money):,.2f}', person, result))